webservice/app/controllers/profiles_controller.rb

SELECT * FROM "profiles" WHERE ("profiles"."idNo" = E'2061009') LIMIT 1
SELECT * FROM "profiles" WHERE ("profiles"."id" = 2061009)
---
  def show
    @profile = Profile.find_by_idNo(params[:id].to_i)
    if @profile
      render :xml => @profile.to_xml
    else
      render :xml => Profile.find(3)