webservice/app/controllers/students_controller.rb

SELECT * FROM "students" WHERE ("students"."idno" = E'2061009') LIMIT 1
---
  def show
    @student = Student.find_by_idno(params[:id])