app/controllers/sessions_controller.rb

UPDATE "users" SET "updated_at" = '2009-01-29 12:32:00.961921', "remember_token" = E'f795a2ba80999abe5dd7cc8064851cbefef5b0fd', "remember_token_expires_at" = '2009-02-12 12:32:00.961247' WHERE "id" = 1
---
  def create
    self.current_user = User.authenticate(params[:login], params[:password])
    if logged_in?
      if params[:remember_me] == "1"
        current_user.remember_me unless current_user.remember_token?
        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
      end
      current_user.last_login = current_user.cur_login
      current_user.cur_login = Time.now

      current_user.save