app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session


    @user = User.new(params[:user])
    @user.save
    if @user.errors.empty?
      self.current_user = @user

      f = Follower.new
      f.idno = session[:stud_idno]
      f.user_id = @user.id
      f.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "last_login", "updated_at", "cur_login", "remember_token", "login", "email") VALUES(E'f0b68c7d071c6c37f37408643f5e3002f14f029b', '2009-01-29 12:32:00.974770', E'2e8fe560081edb626e553cc6d17b4e14acce83d4', NULL, NULL, '2009-01-29 12:32:00.974770', NULL, NULL, E'quire', E'quire@example.com') RETURNING "id"
SELECT count(*) AS count_all FROM "users"
INSERT INTO "followers" ("created_at", "updated_at", "user_id", "idno") VALUES('2009-01-29 12:32:00.979651', '2009-01-29 12:32:00.979651', 3, NULL) RETURNING "id"