User Module/app/controllers/followers_controller.rb

SELECT * FROM "followers" WHERE ("followers"."user_id" = 4)
INSERT INTO "followers" ("updated_at", "idno", "user_id", "created_at") VALUES('2008-12-31 08:08:09.718000', 2061009, 13, '2008-12-31 08:08:09.718000') RETURNING "id"
---
  def create

    if !verify?(params[:idno], params[:vcode])
      redirect_back_or_default('/')
      return
    end
    #init student for easy reference
    stud = Profile.find(params[:idno])

    #adding new ward if logged in
    if logged_in?
      # check if user has already added the ward
      followers = Follower.find_all_by_user_id current_user.id
      followers.each do |f|
        if f.idno.to_s == params[:idno].to_s
          flash[:error]="You are already following #{stud.fullname}"
          redirect_back_or_default('/')
          return
        end
      end

      #all checks done. Time to make follower object
      f = Follower.new
      f.idno = params[:idno]
      f.user_id = current_user.id


      if f.save