User Module/app/controllers/oasis_controller.rb

  def index
    $user = current_user
    @followers = Follower.find_all_by_user_id($user.id)
---
SELECT * FROM "followers" WHERE ("followers"."user_id" = 12)

  def find_followers idno
    @ff = Follower.find_all_by_idno idno
      @ffs= Array.new
      @ff.each do |f|
        @ffs<<User.find(f.user_id)
---
SELECT * FROM "followers" WHERE ("followers"."idno" = E'2061009') LIMIT 1
SELECT * FROM "followers" WHERE ("followers"."user_id" = 5)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1