User Module/app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES(E'fb9508fb932e439688bee84b40e79dcfd3282d55', '2008-12-27 09:06:54.218000', E'938bcc1086861d26a8c0b60ee203dbbe4bfb365d', NULL, NULL, E'jonas', E'jon', '2008-12-27 09:06:54.218000') RETURNING "id"
INSERT INTO "followers" ("updated_at", "idno", "user_id", "created_at") VALUES('2008-12-31 07:46:53.828000', 2061009, 2, '2008-12-31 07:46:53.828000') RETURNING "id"
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session


    @user = User.new(params[:user])
    @user.save
    if @user.errors.empty?
      self.current_user = @user

      f = Follower.new
      f.idno = session[:stud_idno]
      f.user_id = @user.id
      f.save